In [15]:
data['imdb.name.basics.csv.gz']

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [20]:
df = data['imdb.name.basics.csv.gz']
np.round(df.describe())

       birth_year  death_year
count     82736.0      6783.0
mean       1967.0      2001.0
std          22.0        44.0
min           1.0        17.0
25%        1957.0      2001.0
50%        1971.0      2013.0
75%        1981.0      2016.0
max        2014.0      2019.0

In [21]:
df = data['imdb.name.basics.csv.gz']
df.shape

(606648, 6)

In [22]:
df = data['imdb.name.basics.csv.gz']
df.isnull().any()

nconst                False
primary_name          False
birth_year             True
death_year             True
primary_profession     True
known_for_titles       True
dtype: bool

In [99]:
df = data['imdb.name.basics.csv.gz']
df.isnull().sum()

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

In [20]:
df = data['imdb.name.basics.csv.gz']
np.round(df.describe())

       birth_year  death_year
count     82736.0      6783.0
mean       1967.0      2001.0
std          22.0        44.0
min           1.0        17.0
25%        1957.0      2001.0
50%        1971.0      2013.0
75%        1981.0      2016.0
max        2014.0      2019.0

In [21]:
df = data['imdb.name.basics.csv.gz']
df.shape

(606648, 6)

In [22]:
df = data['imdb.name.basics.csv.gz']
df.isnull().any()

nconst                False
primary_name          False
birth_year             True
death_year             True
primary_profession     True
known_for_titles       True
dtype: bool

In [99]:
df = data['imdb.name.basics.csv.gz']
df.isnull().sum()

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

In [16]:
df = data['imdb.name.basics.csv.gz']
df.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [17]:
df = data['imdb.name.basics.csv.gz']
df.tail()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [18]:
df = data['imdb.name.basics.csv.gz']
df.sample(20)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
110058,nm0000391,Rupert Everett,1959.0,NaN,"actor,soundtrack,producer","tt2404639,tt0119738,tt0122541,tt0109592"
149735,nm3314297,Michael La Gattuta,NaN,NaN,"producer,cinematographer,editor","tt1370188,tt9741820,tt7305266,tt2963028"
249866,nm1568353,Vanessa Yardley,NaN,NaN,"writer,miscellaneous","tt2892398,tt0401934,tt0382482,tt2249786"
163700,nm4083310,Joseph Aguon Drake,NaN,NaN,"actor,producer,director","tt5459568,tt5459616,tt4744138,tt6793704"
481743,nm9090528,Ali Rajab,NaN,NaN,director,tt7064776
58641,nm0584189,Peter Michael,1975.0,NaN,actor,"tt1029427,tt2112217,tt0324691,tt0900882"
59491,nm10614128,Vinod Jain,NaN,NaN,"producer,production_manager",tt10087396
528230,nm7815300,Brian Knapp,NaN,NaN,actor,"tt6128764,tt7018288,tt5298928"
3243,nm10224255,Dave Bedwood,NaN,NaN,"writer,producer",NaN
266575,nm5105722,John Mathis,NaN,NaN,"camera_department,writer,director","tt4909094,tt3831634,tt7116312,tt6617382"
574967,nm7235566,Rohit Aarrya,1975.0,NaN,"writer,director,producer","tt9725092,tt4572864,tt9724918,tt9737638"
384803,nm5467355,Émilie Morin,NaN,NaN,actress,"tt2631602,tt8750594"
260248,nm3768477,Paul Rufus Jones,NaN,NaN,"actor,writer,producer","tt5866574,tt2270792,tt2005374,tt1884384"
151428,nm1764169,Carrie Keagan,1980.0,NaN,"producer,writer,actress","tt1907886,tt6211786,tt0364782,tt1412489"
151768,nm2094450,Ram Krishna Pokharel,NaN,NaN,"location_management,producer,miscellaneous","tt7236026,tt4368038,tt1929237,tt9130674"
588992,nm9894970,Blanca Rizzo,NaN,NaN,actress,NaN
204984,nm2574851,Bernard Guerrini,NaN,NaN,"director,writer,cinematographer","tt4980318,tt0975085,tt2811610,tt1469321"
465164,nm4695554,Hannah Alpert,NaN,NaN,"production_designer,art_department,director","tt3411972,tt2071554,tt5716280,tt4462372"
107981,nm10122843,Luz Jimenez,NaN,NaN,NaN,tt7049146
206796,nm2748908,John Woods,NaN,NaN,"actor,producer,director","tt4470260,tt6139690,tt4312656,tt4956018"

In [19]:
df = data['imdb.name.basics.csv.gz']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [20]:
df = data['imdb.name.basics.csv.gz']
np.round(df.describe())

       birth_year  death_year
count     82736.0      6783.0
mean       1967.0      2001.0
std          22.0        44.0
min           1.0        17.0
25%        1957.0      2001.0
50%        1971.0      2013.0
75%        1981.0      2016.0
max        2014.0      2019.0

In [21]:
df = data['imdb.name.basics.csv.gz']
df.shape

(606648, 6)

In [22]:
df = data['imdb.name.basics.csv.gz']
df.isnull().any()

nconst                False
primary_name          False
birth_year             True
death_year             True
primary_profession     True
known_for_titles       True
dtype: bool

In [99]:
df = data['imdb.name.basics.csv.gz']
df.isnull().sum()

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

In [ ]:
data['imdb.title.principals.csv.gz']

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.head()

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.tail()

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.sample(20)

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.info()

In [ ]:
df = data['imdb.title.principals.csv.gz']
np.round(df.describe())

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.shape

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.isnull().any()

In [ ]:
df = data['imdb.title.principals.csv.gz']
df.isnull().sum()

In [ ]:
data['imdb.title.crew.csv.gz']

In [ ]:
df = data['imdb.title.crew.csv.gz']
df.head()

In [ ]:
df = data['imdb.title.crew.csv.gz']
df.tail()

In [ ]:
df = data['imdb.title.crew.csv.gz']
df.sample(20)

In [ ]:
df = data['imdb.title.crew.csv.gz']
df.info()

In [ ]:
df = data['imdb.title.crew.csv.gz']
np.round(df.describe())

In [ ]:
df = data['imdb.title.crew.csv.gz']
df.shape

In [ ]:
df = data['imdb.title.crew.csv.gz']
df.isnull().any()

In [44]:
data['rotten_tomatoes_critic_reviews.csv.gz']

,rotten_tomatoes_link,critic_name,top_critic,publisher_name,review_type,review_score,review_date,review_content
0,m/0814255,Andrew L. Urban,False,Urban Cinefile,Fresh,NaN,2010-02-06,A fantasy adventure that fuses Greek mythology...
1,m/0814255,Louise Keller,False,Urban Cinefile,Fresh,NaN,2010-02-06,"Uma Thurman as Medusa, the gorgon with a coiff..."
2,m/0814255,NaN,False,FILMINK (Australia),Fresh,NaN,2010-02-09,With a top-notch cast and dazzling special eff...
3,m/0814255,Ben McEachen,False,Sunday Mail (Australia),Fresh,3.5/5,2010-02-09,Whether audiences will get behind The Lightnin...
4,m/0814255,Ethan Alter,True,Hollywood Reporter,Rotten,NaN,2010-02-10,What's really lacking in The Lightning Thief i...
...,...,...,...,...,...,...,...,...
1130012,m/zulu_dawn,Chuck O'Leary,False,Fantastica Daily,Rotten,2/5,2005-11-02,NaN
1130013,m/zulu_dawn,Ken Hanke,False,"Mountain Xpress (Asheville, NC)",Fresh,3.5/5,2007-03-07,"Seen today, it's not only a startling indictme..."
1130014,m/zulu_dawn,Dennis Schwartz,False,Dennis Schwartz Movie Reviews,Fresh,B+,2010-09-16,A rousing visual spectacle that's a prequel of...
1130015,m/zulu_dawn,Christopher Lloyd,False,Sarasota Herald-Tribune,Rotten,3.5/5,2011-02-28,"A simple two-act story: Prelude to war, and th..."
1130016,m/zulu_dawn,Brent McKnight,False,The Last Thing I See,Rotten,C,2020-07-09,Rides the line between being a pure artifact o...

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.head()

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.tail()

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.sample(20)

In [45]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1130017 entries, 0 to 1130016
Data columns (total 8 columns):
 #   Column                Non-Null Count    Dtype
---  ------                --------------    -----
 0   rotten_tomatoes_link  1130017 non-null  object
 1   critic_name           1111488 non-null  object
 2   top_critic            1130017 non-null  bool
 3   publisher_name        1130017 non-null  object
 4   review_type           1130017 non-null  object
 5   review_score          824081 non-null   object
 6   review_date           1130017 non-null  object
 7   review_content        1064211 non-null  object
dtypes: bool(1), object(7)
memory usage: 61.4+ MB

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
np.round(df.describe())

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.shape

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.isnull().any()

In [ ]:
df = data['rotten_tomatoes_critic_reviews.csv.gz']
df.isnull().sum()